# ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ComponentRepeaterFailures..::..ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater Property
BuiltInFailures..::..ComponentRepeaterFailures Class See Also
---
There is only one component in this repeater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ComponentRepeaterFailures Class
Autodesk.Revit.DB Namespace